---
kind: property
id: P:Autodesk.Revit.DB.SpacingRule.Layout
zh: 布置、排布、布局、排列
source: html/81018421-ab61-9115-b171-c359e557f49e.htm
---
# Autodesk.Revit.DB.SpacingRule.Layout Property

**中文**: 布置、排布、布局、排列

A choice of several gridline layout rules.

## Syntax (C#)
```csharp
public SpacingRuleLayout Layout { get; }
```

## Remarks
If "None" is chosen, no internal lines will be
generated, but the effect is equivalent to having two
lines, one at each end of the region.